{
  "education": [
    {
      "institution": "CodePath",
      "degree": "Advanced Web Development",
      "startDate": "Aug 2023",
      "endDate": "Nov 2023",
      "logo": "/img/education/codepath.png",
      "description": [
        "Mastered the complete spectrum of web development, seamlessly integrating HTML, CSS, Express, React, and JavaScript for a dynamic user interface.",
        "Applied advanced skills in PostgreSQL to effectively structure and manage relational data, ensuring optimal functionality and seamless user experiences.",
        "Leveraged Railway and PassportJS for secure authentication, collaborated efficiently on GitHub, and achieved successful deployment, showcasing a comprehensive understanding of the tech stack."
      ],
      "skills": [
        "REST APIs",
        "User Experience",
        "API",
        "HTML5",
        "Cascading Style Sheets",
        "Web Development",
        "React.js",
        "JavaScript",
        "Web Project Management",
        "Express.js",
        "Web Services API",
        "Web Design"
      ]
    },
    {
      "institution": "Farmingdale State College",
      "degree": "Computer Science",
      "startDate": "Aug 2022",
      "endDate": "May 2026",
      "logo": "/img/education/farmingdale.png",
      "activities": [
        "GDSC Farmingdale",
        "Farmingdale Coding Society",
        "ACM Computer Tech Club",
        "ACM-W SWiC",
        "FSC-NAACP"
      ],
      "skills": [
        "Python ",
        "C++",
        "Java",
        "Object-Oriented Programming",
        "C "
      ]
    },
    {
      "institution": "CodePath",
      "degree": "Software Engineering",
      "startDate": "Apr 2023",
      "endDate": "Aug 2023",
      "logo": "/img/education/codepath.png",
      "description": [
        "Learned essential topics such as conditional statements, loops, big O notation, dictionaries, strings, and arrays, using Python.",
        "Successfully completed a beginner-level curriculum designed for first and second-year college students, without the need for any previous coding experience, gaining a solid foundation in software development concepts and building fundamental coding skills.",
        "Engaged in a dynamic learning environment, adapting to diverse teaching strategies that accommodated various learning styles and abilities, and acquired valuable knowledge and skills to prepare for more advanced software engineering and computer science coursework."
      ],
      "skills": [
        "Git",
        "Python ",
        "Data Structures",
        "Algorithms"
      ]
    },
    {
      "institution": "CodePath",
      "degree": "Intermediate Android Development",
      "startDate": "Feb 2024",
      "endDate": "Apr 2024",
      "logo": "/img/education/codepath.png",
      "description": [
        "Mastered Kotlin and Android Studio to develop dynamic user interfaces and interactive experiences in Android app development.",
        "Implemented advanced concepts such as RecyclerView, API integration, and data persistence with Room and Shared Preferences for enhanced functionality and user engagement.",
        "Collaborated effectively on GitHub, leveraging industry-standard tools like Railway and PassportJS for secure authentication, demonstrating a comprehensive understanding of the tech stack."
      ],
      "skills": [
        "Kotlin",
        "Android Jetpack",
        "XML",
        "JSON",
        "Java"
      ]
    },
    {
      "institution": "CodePath",
      "degree": "Intermediate Technical Interview Prep",
      "startDate": "Mar 2024",
      "endDate": "Aug 2024",
      "logo": "/img/education/codepath.png",
      "description": [
        "Mastered essential data structures like Linked Lists, Stacks, Queues, Hash Tables, and Binary Trees.",
        "Gained expertise in algorithmic analysis, including understanding Big O notation.",
        "Acquired practical skills in implementing efficient algorithms for problem-solving challenges.",
        "Equipped with strategies to excel in technical phone screens and on-site interviews.",
        "Explored application preparation techniques tailored for tech roles and received behavioral and general interviewing tips.",
        "Developed a comprehensive understanding of software development fundamentals and the tech hiring process."
      ],
      "skills": [
        "Data Structures",
        "Algorithms",
        "Python "
      ]
    },
    {
      "institution": "MLH Fellowship",
      "degree": "Site Reliability Engineering Program",
      "startDate": "Jun 2024",
      "endDate": "Sep 2024",
      "logo": "/img/education/mlh.png",
      "description": [
        "The Site Reliability Engineering Program is an opportunity to learn how to be a great Site Reliability Engineer by completing an interactive curriculum getting you hands on experience with the tools used by thousands of companies around the world."
      ]
    }
  ]
}
